## Modules
Check for modules

In [16]:
!pip install xlrd

Requirement already satisfied: xlrd in c:\python37\idea1\lib\site-packages (1.2.0)

In [17]:
!pip install xlsxwriter

Requirement already satisfied: xlsxwriter in c:\python37\idea1\lib\site-packages (1.2.9)

In [18]:
import pandas as pd

## Hard code directory 
This should be relative to data directory with data\in and data\out

In [19]:
import os

In [20]:
#Get the file 
os.getcwd()

'C:\\Users\\i080272\\OneDrive - SAP SE\\Documents\\oreilly_python_excel\\python-powered-excel-master\\notebooks'

In [21]:
os.listdir()

['.ipynb_checkpoints',
 'cond.png',
 'cond_formatting.png',
 'df_info.txt',
 'IDEA Excel Analysis .ipynb',
 'IDEA Rough Test .ipynb',
 'IDEA_TextBlob_Spacy_Gender.ipynb',
 'IDEA_widgets_No_Go.ipynb',
 'Lesson 01 - Sales.ipynb',
 'Lesson 02 - Accounting.ipynb',
 'Lesson 03 - Supply.ipynb',
 'Lesson 04 - HR.ipynb',
 'Lesson 05 - Final Report.ipynb',
 'q_Chart.png']

In [22]:
main_dir = os.path.join('..')

In [23]:
main_dir

'..'

In [24]:
os.listdir(main_dir)  #gets up a level

['data', 'notebooks', 'README.md', 'requirements.txt']

In [25]:
data_dir = os.path.join(main_dir,'data')
os.listdir(data_dir)

['accounting.xlsx',
 'accounting_summary.xlsx',
 'accounting_summary_master.xlsx',
 'combined_report.xlsx',
 'hr_report.xlsx',
 'hr_summary_master.xlsx',
 'in',
 'max_sales_by_client.xlsx',
 'out',
 'Quarterly Report.xlsx',
 'sales.csv',
 'sales.xlsx',
 'sales1.xlsx',
 'sales_by_client.xlsx',
 'sales_formatted.xlsx',
 'supply.xlsx',
 'supply_summary_master.xlsx']

In [26]:
data_dir = os.path.join(main_dir,'data\in')
os.listdir(data_dir)

['sales.csv', 'sales_xlsx.xlsx']

In [27]:
data_dir = os.path.join(main_dir, 'sales.csv' )

In [28]:
df = pd.read_csv(r'C:\Users\i080272\OneDrive - SAP SE\Documents\oreilly_python_excel\python-powered-excel-master\data\in\sales.csv')

## Getting dtypes info 
several experiments to get dtypes...keeping them as examples

In [29]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 62 entries, 0 to 61
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Worker      62 non-null     object
 1   Month       62 non-null     int64
 2   Client      62 non-null     object
 3   Qty         62 non-null     int64
 4   Amt         62 non-null     int64
 5   Commission  62 non-null     float64
dtypes: float64(1), int64(3), object(2)
memory usage: 3.0+ KB

### writing to a file - no good

In [34]:
#https://stackoverflow.com/questions/54221673/is-there-a-way-to-export-pandas-dataframe-info-df-info-into-an-excel-file 
import io
buffer = io.StringIO()
df.info(buf=buffer)
s = buffer.getvalue()
with open("df_info.txt", "w", encoding="utf-8") as f:
    f.write(s)

In [35]:
with open ("df_info.txt", "r") as myfile:
    data=myfile.readlines()

In [36]:
type(data)
data

["<class 'pandas.core.frame.DataFrame'>\n",
 'RangeIndex: 62 entries, 0 to 61\n',
 'Data columns (total 6 columns):\n',
 ' #   Column      Non-Null Count  Dtype  \n',
 '---  ------      --------------  -----  \n',
 ' 0   Worker      62 non-null     object \n',
 ' 1   Month       62 non-null     int64  \n',
 ' 2   Client      62 non-null     object \n',
 ' 3   Qty         62 non-null     int64  \n',
 ' 4   Amt         62 non-null     int64  \n',
 ' 5   Commission  62 non-null     float64\n',
 'dtypes: float64(1), int64(3), object(2)\n',
 'memory usage: 3.0+ KB\n']

In [37]:
data[0]

"<class 'pandas.core.frame.DataFrame'>\n"

In [38]:
data[1]

'RangeIndex: 62 entries, 0 to 61\n'

In [39]:
for x,k in enumerate(data):
    print("Entry ",x," ",k, end='')

Entry  0   <class 'pandas.core.frame.DataFrame'>
Entry  1   RangeIndex: 62 entries, 0 to 61
Entry  2   Data columns (total 6 columns):
Entry  3    #   Column      Non-Null Count  Dtype
Entry  4   ---  ------      --------------  -----
Entry  5    0   Worker      62 non-null     object
Entry  6    1   Month       62 non-null     int64
Entry  7    2   Client      62 non-null     object
Entry  8    3   Qty         62 non-null     int64
Entry  9    4   Amt         62 non-null     int64
Entry  10    5   Commission  62 non-null     float64
Entry  11   dtypes: float64(1), int64(3), object(2)
Entry  12   memory usage: 3.0+ KB

In [40]:
rangeindex = data[1].split(" ")

In [41]:
rangeindex

['RangeIndex:', '62', 'entries,', '0', 'to', '61\n']

In [42]:
rangeindex[1]

'62'

In [43]:
rangeIndex = int(rangeindex[1])
rangeIndex * 1.0

62.0

In [44]:
data[2]
data[2].split(" ")
data[2].split(" ")

['Data', 'columns', '(total', '6', 'columns):\n']

In [45]:
data[2].split(" ")[3]

'6'

In [46]:
indexCols = int(data[2].split(" ")[3])
indexCols * 1

6

In [47]:
indexcol = data[5].split(" ")
indexcolname = indexcol[4]
indexcoltype= indexcol[16]
print(indexcolname, indexcoltype)

Worker object

In [48]:
data
indexcol = data[6].split(" ")
indexcol
indexcolname = indexcol[4]
indexcolname
indexcoltype= indexcol[17]
indexcoltype
print(indexcolname, indexcoltype)

Month int64

In [49]:
data
indexcol = data[7].split(" ")
indexcol
indexcolname = indexcol[4]
indexcolname
indexcoltype= indexcol[16]
indexcoltype
print(indexcolname, indexcoltype)

Client object

In [50]:
data
# indexcol = data[8].split(" ")
# indexcol
# indexcolname = indexcol[4]
# indexcolname
# indexcoltype= indexcol[17]
# indexcoltype
# print(indexcolname, indexcoltype)

["<class 'pandas.core.frame.DataFrame'>\n",
 'RangeIndex: 62 entries, 0 to 61\n',
 'Data columns (total 6 columns):\n',
 ' #   Column      Non-Null Count  Dtype  \n',
 '---  ------      --------------  -----  \n',
 ' 0   Worker      62 non-null     object \n',
 ' 1   Month       62 non-null     int64  \n',
 ' 2   Client      62 non-null     object \n',
 ' 3   Qty         62 non-null     int64  \n',
 ' 4   Amt         62 non-null     int64  \n',
 ' 5   Commission  62 non-null     float64\n',
 'dtypes: float64(1), int64(3), object(2)\n',
 'memory usage: 3.0+ KB\n']

### Using dtypes from file  not good

In [55]:
import csv 
#Should be setup as dictionary ... import csv
with open('df_info.txt', 'r') as data: 
      
    for line in csv.DictReader(data): 
        print(line)

OrderedDict([("<class 'pandas.core.frame.DataFrame'>", 'RangeIndex: 62 entries'), (None, [' 0 to 61'])])
OrderedDict([("<class 'pandas.core.frame.DataFrame'>", 'Data columns (total 6 columns):')])
OrderedDict([("<class 'pandas.core.frame.DataFrame'>", ' #   Column      Non-Null Count  Dtype  ')])
OrderedDict([("<class 'pandas.core.frame.DataFrame'>", '---  ------      --------------  -----  ')])
OrderedDict([("<class 'pandas.core.frame.DataFrame'>", ' 0   Worker      62 non-null     object ')])
OrderedDict([("<class 'pandas.core.frame.DataFrame'>", ' 1   Month       62 non-null     int64  ')])
OrderedDict([("<class 'pandas.core.frame.DataFrame'>", ' 2   Client      62 non-null     object ')])
OrderedDict([("<class 'pandas.core.frame.DataFrame'>", ' 3   Qty         62 non-null     int64  ')])
OrderedDict([("<class 'pandas.core.frame.DataFrame'>", ' 4   Amt         62 non-null     int64  ')])
OrderedDict([("<class 'pandas.core.frame.DataFrame'>", ' 5   Commission  62 non-null     float64')])
OrderedDict([("<class 'pandas.core.frame.DataFrame'>", 'dtypes: float64(1)'), (None, [' int64(3)', ' object(2)'])])
OrderedDict([("<class 'pandas.core.frame.DataFrame'>", 'memory usage: 3.0+ KB')])

### Using dtypes
Putting it into dictionary and changing to string

In [56]:
df.dtypes

Worker         object
Month           int64
Client         object
Qty             int64
Amt             int64
Commission    float64
dtype: object

In [57]:
indextypes = df.dtypes
print(str(indextypes))
dict(indextypes)

Worker         object
Month           int64
Client         object
Qty             int64
Amt             int64
Commission    float64
dtype: object

{'Worker': dtype('O'),
 'Month': dtype('int64'),
 'Client': dtype('O'),
 'Qty': dtype('int64'),
 'Amt': dtype('int64'),
 'Commission': dtype('float64')}

In [58]:
indextypes['Worker']
indextypes['Month']
indextypes['Client']
#write it out with out the dtype?
t = indextypes['Qty']
t
#type(t) #is a numpy.dtype
tt = str(t) #is an object 
tt
# type(tt)  #is a string

'int64'

In [60]:
df.describe()

           Month          Qty           Amt   Commission
count  62.000000    62.000000     62.000000    62.000000
mean    4.032258   940.161290   4700.806452   705.120968
std     0.809123   574.860616   2874.303079   431.145462
min     3.000000     0.000000      0.000000     0.000000
25%     3.000000   550.000000   2750.000000   412.500000
50%     4.000000   900.000000   4500.000000   675.000000
75%     5.000000  1200.000000   6000.000000   900.000000
max     5.000000  3000.000000  15000.000000  2250.000000

In [61]:
df.columns  #good but not type

Index(['Worker', 'Month', 'Client', 'Qty', 'Amt', 'Commission'], dtype='object')

In [62]:
 df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 62 entries, 0 to 61
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Worker      62 non-null     object
 1   Month       62 non-null     int64
 2   Client      62 non-null     object
 3   Qty         62 non-null     int64
 4   Amt         62 non-null     int64
 5   Commission  62 non-null     float64
dtypes: float64(1), int64(3), object(2)
memory usage: 3.0+ KB

In [63]:
df.head()

  Worker  Month               Client   Qty    Amt  Commission
0      J      3           Blue Cross  3000  15000      2250.0
1      J      3         Dunmore High  2000  10000      1500.0
2      J      3  Maguire Advertising  1750   8750      1312.5
3      J      3    Decker Automotive  1000   5000       750.0
4      D      3    Lackawanna County  2000  10000      1500.0

## Lookup tables 
using dictionary as lookup and taking an excel file and making a dictionary to replace values

In [64]:
df.tail()

   Worker  Month                   Client  Qty   Amt  Commission
57      S      5            Stone and Son  500  2500       375.0
58      A      5                Bob Vance  550  2750       412.5
59      A      5  Scranton Animal Shelter  100   500        75.0
60      A      5                  Cornell    0     0         0.0
61      A      5            Barbara Allen    0     0         0.0

In [65]:
#find and replace 
#ctrl-F in Excel....
employees = { 
'J':'Jim',
'D': 'Dwight',
'S': 'Stanley',
'P': 'Phyllis',
'A':'Andy'}

In [66]:
employees

{'J': 'Jim', 'D': 'Dwight', 'S': 'Stanley', 'P': 'Phyllis', 'A': 'Andy'}

In [67]:
df.columns

Index(['Worker', 'Month', 'Client', 'Qty', 'Amt', 'Commission'], dtype='object')

In [68]:
df['Worker'].replace(employees)

0         Jim
1         Jim
2         Jim
3         Jim
4      Dwight
       ...
57    Stanley
58       Andy
59       Andy
60       Andy
61       Andy
Name: Worker, Length: 62, dtype: object

In [69]:
df['Worker'].replace(employees, inplace = True)

In [70]:
df

     Worker  Month                   Client   Qty    Amt  Commission
0       Jim      3               Blue Cross  3000  15000      2250.0
1       Jim      3             Dunmore High  2000  10000      1500.0
2       Jim      3      Maguire Advertising  1750   8750      1312.5
3       Jim      3        Decker Automotive  1000   5000       750.0
4    Dwight      3        Lackawanna County  2000  10000      1500.0
..      ...    ...                      ...   ...    ...         ...
57  Stanley      5            Stone and Son   500   2500       375.0
58     Andy      5                Bob Vance   550   2750       412.5
59     Andy      5  Scranton Animal Shelter   100    500        75.0
60     Andy      5                  Cornell     0      0         0.0
61     Andy      5            Barbara Allen     0      0         0.0

[62 rows x 6 columns]

## def col_replace

In [71]:
def col_replace(df,df_col, replacement_dict, in_place):
    ''' Takes df and col with replacement values 
    df pandas dataframe
    df_col the target column to replace with values from replacement_dict
    in_place default True, update the columns in place
    NO error checking 
    '''
    print(df.head())
    in_place = True 
    df[df_col].replace(replacement_dict, inplace = in_place)
    print(df.head())

In [79]:
col_replace(df,'Worker',employees, True)

   Worker  Month               Client   Qty    Amt  Commission
0     Jim      3           Blue Cross  3000  15000      2250.0
1     Jim      3         Dunmore High  2000  10000      1500.0
2     Jim      3  Maguire Advertising  1750   8750      1312.5
3     Jim      3    Decker Automotive  1000   5000       750.0
4  Dwight      3    Lackawanna County  2000  10000      1500.0
   Worker  Month               Client   Qty    Amt  Commission
0     Jim      3           Blue Cross  3000  15000      2250.0
1     Jim      3         Dunmore High  2000  10000      1500.0
2     Jim      3  Maguire Advertising  1750   8750      1312.5
3     Jim      3    Decker Automotive  1000   5000       750.0
4  Dwight      3    Lackawanna County  2000  10000      1500.0

## def lookup 
Getting a lookup excel and making it a dictionary

In [80]:
#creating replacement dictionary from xls or csv 
#https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.to_dict.html 
#https://stackoverflow.com/questions/6740918/creating-a-dictionary-from-a-csv-file 
import pandas as pd
pd.read_excel(r'C:\xampp\employee_lookup.xlsx',  index_col=0, squeeze=True).to_dict()  #remove header=None

{'J': 'Jim', 'S': 'Stanley ', 'P ': 'Phyllis ', 'D': 'Dwight', 'M': 'Max '}

In [81]:
employees

{'J': 'Jim', 'D': 'Dwight', 'S': 'Stanley', 'P': 'Phyllis', 'A': 'Andy'}

In [82]:
excel_file = r'C:\xampp\employee_lookup.xlsx'

In [83]:
def lookup_tab(excel_file, no_header):
    '''
    Read excel file in and create a dictionary to be used with lookup replace in pandas 
    excel_file is xlxs 
    no_header = True or False 
    Read an excel file in without the header and create a dictionary 
    '''
    if no_header:
        lookup_dict = pd.read_excel(excel_file , header=None, index_col=0, squeeze=True).to_dict() 
    else:
        lookup_dict = pd.read_excel(excel_file ,  index_col=0, squeeze=True).to_dict()  #remove header=None
    return(lookup_dict)

In [84]:
lookup_tab(excel_file, no_header = True)

{'Abbreviation ': 'Name ',
 'J': 'Jim',
 'S': 'Stanley ',
 'P ': 'Phyllis ',
 'D': 'Dwight',
 'M': 'Max '}

In [85]:
lookup_dict = lookup_tab(excel_file, no_header = True)

In [86]:
df.head(3)

  Worker  Month               Client   Qty    Amt  Commission
0    Jim      3           Blue Cross  3000  15000      2250.0
1    Jim      3         Dunmore High  2000  10000      1500.0
2    Jim      3  Maguire Advertising  1750   8750      1312.5

In [87]:
col_replace(df,'Worker',employees, True)

   Worker  Month               Client   Qty    Amt  Commission
0     Jim      3           Blue Cross  3000  15000      2250.0
1     Jim      3         Dunmore High  2000  10000      1500.0
2     Jim      3  Maguire Advertising  1750   8750      1312.5
3     Jim      3    Decker Automotive  1000   5000       750.0
4  Dwight      3    Lackawanna County  2000  10000      1500.0
   Worker  Month               Client   Qty    Amt  Commission
0     Jim      3           Blue Cross  3000  15000      2250.0
1     Jim      3         Dunmore High  2000  10000      1500.0
2     Jim      3  Maguire Advertising  1750   8750      1312.5
3     Jim      3    Decker Automotive  1000   5000       750.0
4  Dwight      3    Lackawanna County  2000  10000      1500.0

## Groupby
From df get dtypes, turn into strings, create groupby list and agg dictionary

In [96]:
#annalysis which cols... 
#20!/18! 
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 62 entries, 0 to 61
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Worker      62 non-null     object
 1   Month       62 non-null     int64
 2   Client      62 non-null     object
 3   Qty         62 non-null     int64
 4   Amt         62 non-null     int64
 5   Commission  62 non-null     float64
dtypes: float64(1), int64(3), object(2)
memory usage: 3.0+ KB

In [98]:
df.dtypes

Worker         object
Month           int64
Client         object
Qty             int64
Amt             int64
Commission    float64
dtype: object

In [106]:
#put df.dtypes in dictionary 
obj_dtypes = df.dtypes.to_dict()
obj_dtypes

{'Worker': dtype('O'),
 'Month': dtype('int64'),
 'Client': dtype('O'),
 'Qty': dtype('int64'),
 'Amt': dtype('int64'),
 'Commission': dtype('float64')}

In [109]:
#make df.dtypes a reg dictionary of strings 
str_dtypes ={} 
for k,v in obj_dtypes.items():
    print( k, v)
    str_dtypes[k] =str(v)
str_dtypes

Worker object
Month int64
Client object
Qty int64
Amt int64
Commission float64

{'Worker': 'object',
 'Month': 'int64',
 'Client': 'object',
 'Qty': 'int64',
 'Amt': 'int64',
 'Commission': 'float64'}

In [135]:
sales_by_client[:3]

            Client  Worker   Qty   Amt
                             sum   sum
0  Apex Technology  Dwight  1700  8500
1          Athleap     Jim   350  1750
2    Barbara Allen    Andy  1300  6500

In [134]:
#group by can be a list of columns but we only want object 
groupby_var = [] 
#aggregates can be dictionary 
agg_var ={}

for k,v in str_dtypes.items():
    if v == 'object':
        groupby_var.append(k)
    elif  v == 'int64' :
        agg_var[k]='sum'
    elif v == 'float64':
        agg_var[k]='sum'
print("groupby_var...",groupby_var  )
print('agg_var.....',agg_var)

groupby_var... ['Worker', 'Client']
agg_var..... {'Month': 'sum', 'Qty': 'sum', 'Amt': 'sum', 'Commission': 'sum'}

In [141]:
sales_by_client = df.groupby(['Worker','Client'], as_index =False).\
agg({
    'Qty':[sum],
    'Amt':[sum]
})
sales_by_client.iloc[:3]

  Worker         Client   Qty   Amt
                          sum   sum
0   Andy  Barbara Allen  1300  6500
1   Andy      Bob Vance  1300  6500
2   Andy        Cornell   100   500

In [142]:
#take out worker and client and use list 
sales_by_client = df.groupby((groupby_var), as_index =False).\
agg({
    'Qty':[sum],
    'Month':[sum],
    'Amt':[sum]
})
sales_by_client.iloc[:3]

  Worker         Client   Qty Month   Amt
                          sum   sum   sum
0   Andy  Barbara Allen  1300    12  6500
1   Andy      Bob Vance  1300     8  6500
2   Andy        Cornell   100     9   500

In [143]:
#take out worker and client and use list 
#take out manual dictionary and use agg_var
sales_by_client = df.groupby((groupby_var), as_index =False).\
agg(agg_var)
    
sales_by_client.iloc[:3]

  Worker         Client  Month   Qty   Amt  Commission
0   Andy  Barbara Allen     12  1300  6500       975.0
1   Andy      Bob Vance      8  1300  6500       975.0
2   Andy        Cornell      9   100   500        75.0

In [145]:
sales_by_client.columns = ['Worker','Client','Mon','Qty','Amt','Commission']

In [92]:
sales_by_client #new col names

                     Client      Rep   Qty  Total Amount
0           Apex Technology   Dwight  1700          8500
1                   Athleap      Jim   350          1750
2             Barbara Allen     Andy  1300          6500
3                Blue Cross      Jim  6900         34500
4                 Bob Vance     Andy  1300          6500
5                   Cornell     Andy   100           500
6         Decker Automotive      Jim  1000          5000
7                     Down!  Stanley  3250         16250
8              Dunmore High      Jim  4250         21250
9        East Penn Seminary  Phyllis  4000         20000
10           Harper Collins   Dwight  2400         12000
11            Haymont Tires  Stanley  2700         13500
12    Ken's Beauty Supplies  Phyllis  3400         17000
13        Lackawanna County   Dwight  4700         23500
14      Maguire Advertising      Jim  3250         16250
15          Prestige Postal   Dwight  1950          9750
16  Scranton Animal Shelter     Andy   200          1000
17            Scranton Golf      Jim  1000          5000
18     Scranton White Pages   Dwight  4000         20000
19           Steamtown Mall  Phyllis  3800         19000
20            Stone and Son  Stanley  2040         10200
21    Stone, Cooper, Grandy   Dwight   950          4750
22         Tract Industries  Stanley  3200         16000
23               Vance Ref.     Andy   550          2750

In [93]:
sales_by_client = df.groupby(['Worker'], as_index =False).\
agg({
    'Qty':[sum],
    'Amt':[sum]
})
sales_by_client

    Worker    Qty    Amt
              sum    sum
0     Andy   3450  17250
1   Dwight  15700  78500
2      Jim  16750  83750
3  Phyllis  11200  56000
4  Stanley  11190  55950

In [94]:
sales_by_client = df.groupby(['Worker'], as_index =False).\
agg({
    'Qty':[sum],
    'Amt':[sum]
})
sales_by_client

    Worker    Qty    Amt
              sum    sum
0     Andy   3450  17250
1   Dwight  15700  78500
2      Jim  16750  83750
3  Phyllis  11200  56000
4  Stanley  11190  55950

In [95]:
sales_by_client = df.groupby(['Worker'], as_index =False).\
agg({
    'Qty':[sum],
    'Amt':[sum], 
    'Commission':[sum]
})
sales_by_client

    Worker    Qty    Amt Commission
              sum    sum        sum
0     Andy   3450  17250     2587.5
1   Dwight  15700  78500    11775.0
2      Jim  16750  83750    12562.5
3  Phyllis  11200  56000     8400.0
4  Stanley  11190  55950     8392.5

In [602]:
sales_by_client = df.groupby(['Worker'], as_index =False).\
agg({
    'Qty':[sum],
    'Amt':[sum], 
    'Commission':[sum]
})
sales_by_client

    Worker    Qty    Amt Commission
              sum    sum        sum
0     Andy   3450  17250     2587.5
1   Dwight  15700  78500    11775.0
2      Jim  16750  83750    12562.5
3  Phyllis  11200  56000     8400.0
4  Stanley  11190  55950     8392.5

## Output to Excel

In [199]:
output_file = os.path.join('..', 'data', 'sales.xlsx')

In [200]:
sales_by_client.to_excel(output_file, engine='xlsxwriter')

## Output to Excel XLSX 
https://xlsxWriter.readthedocs.io

In [274]:
os.stat('cond.png')

os.stat_result(st_mode=33206, st_ino=5066549582001913, st_dev=1983372511, st_nlink=1, st_uid=0, st_gid=0, st_size=97783, st_atime=1584703684, st_mtime=1584629655, st_ctime=1584629358)

In [280]:
#https://stackoverflow.com/questions/27549217/ctime-atime-and-mtime-how-to-interpret-them 
import os
import datetime
print(datetime.datetime.fromtimestamp(os.stat("cond.png").st_atime))

2020-03-20 07:28:04.308661

In [282]:
import os

def file_size(fname):
    info = os.stat(fname)
    return info.st_size


for root, dirs, files in os.walk("."):
    for filename in files:
        try:
            print(filename + '      : ' + str(file_size(filename)) + "bytes")
        except:
            print("throw away error for now!" )

cond.png      : 97783bytes
cond_formatting.png      : 97783bytes
IDEA Excel Pivot .ipynb      : 63980bytes
IDEA_TextBlob_Spacy_Gender.ipynb      : 38104bytes
IDEA_widgets_No_Go.ipynb      : 4173bytes
Lesson 01 - Sales.ipynb      : 35877bytes
Lesson 02 - Accounting.ipynb      : 29555bytes
Lesson 03 - Supply.ipynb      : 23816bytes
Lesson 04 - HR.ipynb      : 27035bytes
Lesson 05 - Final Report.ipynb      : 31778bytes
q_Chart.png      : 244635bytes
throw away error for now!
throw away error for now!
throw away error for now!
throw away error for now!
throw away error for now!
throw away error for now!
throw away error for now!
throw away error for now!

In [283]:
os.listdir('..\data')

['accounting.xlsx',
 'accounting_summary_master.xlsx',
 'combined_report.xlsx',
 'hr_report.xlsx',
 'hr_summary_master.xlsx',
 'max_sales_by_client.xlsx',
 'sales.csv',
 'sales.xlsx',
 'sales1.xlsx',
 'sales_by_client.xlsx',
 'sales_formatted.xlsx',
 'supply.xlsx',
 'supply_summary_master.xlsx']

In [284]:
# First, let's define the name of the file we want to create:
output_file = os.path.join('..', 'data', 'max_sales_by_client.xlsx')
output_file

'..\\data\\max_sales_by_client.xlsx'

In [285]:
sales_by_client.to_excel(output_file, engine='xlsxwriter')

In [286]:
output_file = os.path.join('..', 'data', 'sales_formatted.xlsx')
writer = pd.ExcelWriter(output_file, engine='xlsxwriter')
workbook = writer.book

In [287]:
#rgbtohex.net

In [288]:
header_format = workbook.add_format({
    'bold':True,
    'align':'center',
    'valign':'top',
    'font_color':'white',
    'font_size':12
})

In [289]:
number_format = workbook.add_format({ 'num_format':'$#,##0.00'})

In [290]:
sheet = 'sales summary'
sales_by_client.to_excel(writer, sheet_name=sheet) #index=False error on multipsheet

In [291]:
worksheet = writer.sheets[sheet]

In [292]:
sales_by_client.columns = ['Client', 'Rep', 'Qty', 'Total Amount']  #be sure not to have mulitple lines on titles

In [293]:
for col_num ,  value in enumerate(sales_by_client.columns.values):
    print(col_num,value)  
'''
be careful that it is not tuples! 
0 ('Worker', '')
1 ('Qty', 'sum')
2 ('Amt', 'sum')
3 ('Commission', 'sum')

'''

0 Client
1 Rep
2 Qty
3 Total Amount

"\nbe careful that it is not tuples! \n0 ('Worker', '')\n1 ('Qty', 'sum')\n2 ('Amt', 'sum')\n3 ('Commission', 'sum')\n\n"

In [294]:
for col_num ,  value in enumerate(sales_by_client.columns.values):
    worksheet.write(0,col_num, value, header_format)

In [295]:
#format the header ... 
worksheet.set_column('A:B',14, None)
worksheet.set_column('C:D',14, number_format )

0

In [296]:
writer.save()

## Sheet names 
Hopefully not needed!

In [301]:
accounting_file = os.path.join('..', 'data', 'accounting.xlsx')

In [302]:
a_df = pd.read_excel(accounting_file, sheet_name='Angela')

In [303]:
k_df =  pd.read_excel(accounting_file, sheet_name='Kevin')

In [304]:
o_df =  pd.read_excel(accounting_file, sheet_name='Oscar')

In [308]:
a_df.head()

              Customer  Bill Date  Amount  Paid            Paid Date  Balance
0           Blue Cross 2019-03-01    9900  9900  2019-03-15 00:00:00        0
1         Dunmore High 2019-03-01    6600     0  2019-03-15 00:00:00     6600
2  Maguire Advertising 2019-03-01    5775  5000  2019-03-15 00:00:00      775
3    Decker Automotive 2019-03-01    3300  3000  2019-03-15 00:00:00      300
4    Lackawanna County 2019-03-01    6600  6000  2019-03-15 00:00:00      600

In [309]:
a_df.head(3)

              Customer  Bill Date  Amount  Paid            Paid Date  Balance
0           Blue Cross 2019-03-01    9900  9900  2019-03-15 00:00:00        0
1         Dunmore High 2019-03-01    6600     0  2019-03-15 00:00:00     6600
2  Maguire Advertising 2019-03-01    5775  5000  2019-03-15 00:00:00      775

In [310]:
k_df.head(3)

  Employee       Date    Expense  Amount Requested Justification  Amount Paid
0  Michael 2019-03-01  Gas to NY                75    Seeing Jan           75
1  Michael 2019-03-07  Gas to NY                75    Seeing Jan           75
2  Michael 2019-03-09  Gas to NY                75    Seeing Jan           75

In [311]:
o_df.head(3)

   Month                   Item  Amount Paid
0  March       HammerMill Paper         1000
1  March       Fuel - Warehouse          200
2  March  Equipment - Warehouse          500

In [314]:
frames = pd.read_excel(accounting_file, sheet_name=None) #get all data

In [313]:
frames.keys()

dict_keys(['Angela', 'Kevin', 'Oscar'])

In [320]:
type(frames)

dict

In [321]:
frames['Angela'].head()

              Customer  Bill Date  Amount  Paid            Paid Date  Balance
0           Blue Cross 2019-03-01    9900  9900  2019-03-15 00:00:00        0
1         Dunmore High 2019-03-01    6600     0  2019-03-15 00:00:00     6600
2  Maguire Advertising 2019-03-01    5775  5000  2019-03-15 00:00:00      775
3    Decker Automotive 2019-03-01    3300  3000  2019-03-15 00:00:00      300
4    Lackawanna County 2019-03-01    6600  6000  2019-03-15 00:00:00      600

## Date manipulation 
oh the horror...

In [322]:
df_a = frames['Angela']

In [330]:
df_a.info() # datetime64[ns]

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 60 entries, 0 to 59
Data columns (total 6 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Customer   60 non-null     object
 1   Bill Date  60 non-null     datetime64[ns]
 2   Amount     60 non-null     int64
 3   Paid       60 non-null     int64
 4   Paid Date  60 non-null     object
 5   Balance    60 non-null     int64
dtypes: datetime64[ns](1), int64(3), object(2)
memory usage: 2.9+ KB

In [331]:
df_a.head()

              Customer  Bill Date  Amount  Paid            Paid Date  Balance
0           Blue Cross 2019-03-01    9900  9900  2019-03-15 00:00:00        0
1         Dunmore High 2019-03-01    6600     0  2019-03-15 00:00:00     6600
2  Maguire Advertising 2019-03-01    5775  5000  2019-03-15 00:00:00      775
3    Decker Automotive 2019-03-01    3300  3000  2019-03-15 00:00:00      300
4    Lackawanna County 2019-03-01    6600  6000  2019-03-15 00:00:00      600

In [332]:
df_a['Bill Date'].dt.month.head(3)

0    3
1    3
2    3
Name: Bill Date, dtype: int64

In [336]:
df_a['Bill Date'].dt.day.head(3)

0    1
1    1
2    1
Name: Bill Date, dtype: int64

In [338]:
df_a['Bill Date'].dt.time.head()

0    00:00:00
1    00:00:00
2    00:00:00
3    00:00:00
4    00:00:00
Name: Bill Date, dtype: object

In [342]:
list(df_a['Paid Date'])[:3]

[datetime.datetime(2019, 3, 15, 0, 0),
 datetime.datetime(2019, 3, 15, 0, 0),
 datetime.datetime(2019, 3, 15, 0, 0)]

In [345]:
today_date = "July 9, 2020"

In [346]:
pd.to_datetime(today_date)

Timestamp('2020-07-09 00:00:00')

In [348]:
#have blank dates with - use coerce! to push to NaT 
df_a['Paid Date']=pd.to_datetime(df_a['Paid Date'], errors ='coerce')

In [355]:
df_a.head()

              Customer  Bill Date  Amount  Paid  Paid Date  Balance
0           Blue Cross 2019-03-01    9900  9900 2019-03-15        0
1         Dunmore High 2019-03-01    6600     0 2019-03-15     6600
2  Maguire Advertising 2019-03-01    5775  5000 2019-03-15      775
3    Decker Automotive 2019-03-01    3300  3000 2019-03-15      300
4    Lackawanna County 2019-03-01    6600  6000 2019-03-15      600

In [356]:
df_a['New TAT'] = df_a['Paid Date'] - df_a['Bill Date']

In [357]:
df_a.head()  #new TAT is string obj

              Customer  Bill Date  Amount  Paid  Paid Date  Balance New TAT
0           Blue Cross 2019-03-01    9900  9900 2019-03-15        0 14 days
1         Dunmore High 2019-03-01    6600     0 2019-03-15     6600 14 days
2  Maguire Advertising 2019-03-01    5775  5000 2019-03-15      775 14 days
3    Decker Automotive 2019-03-01    3300  3000 2019-03-15      300 14 days
4    Lackawanna County 2019-03-01    6600  6000 2019-03-15      600 14 days

In [358]:
df_a['New TAT'] = df_a['New TAT'] / pd.to_timedelta(1, unit='D')

In [359]:
df_a.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 60 entries, 0 to 59
Data columns (total 7 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Customer   60 non-null     object
 1   Bill Date  60 non-null     datetime64[ns]
 2   Amount     60 non-null     int64
 3   Paid       60 non-null     int64
 4   Paid Date  58 non-null     datetime64[ns]
 5   Balance    60 non-null     int64
 6   New TAT    58 non-null     float64
dtypes: datetime64[ns](2), float64(1), int64(3), object(1)
memory usage: 3.4+ KB

In [360]:
df_a['Mont'] = df_a['Bill Date'].dt.strftime('%B') #do last cant convert

In [362]:
df_a.head()

,Customer,Bill Date,Amount,Paid,Paid Date,Balance,New TAT,Mont
0,Blue Cross,2019-03-01,9900,9900,2019-03-15,0,14.0,March
1,Dunmore High,2019-03-01,6600,0,2019-03-15,6600,14.0,March
2,Maguire Advertising,2019-03-01,5775,5000,2019-03-15,775,14.0,March
3,Decker Automotive,2019-03-01,3300,3000,2019-03-15,300,14.0,March
4,Lackawanna County,2019-03-01,6600,6000,2019-03-15,600,14.0,March

In [364]:
df_a['Bill Date'] = df_a['Bill Date'].dt.month

AttributeError: Can only use .dt accessor with datetimelike values

In [366]:
df_a.head()

,Customer,Bill Date,Amount,Paid,Paid Date,Balance,New TAT,Mont
0,Blue Cross,3,9900,9900,2019-03-15,0,14.0,March
1,Dunmore High,3,6600,0,2019-03-15,6600,14.0,March
2,Maguire Advertising,3,5775,5000,2019-03-15,775,14.0,March
3,Decker Automotive,3,3300,3000,2019-03-15,300,14.0,March
4,Lackawanna County,3,6600,6000,2019-03-15,600,14.0,March

In [378]:
#need to use existing columns 
customer_summary = df_a.groupby(['Bill Date','Mont','Customer'], as_index=False).agg \
({
    'Amount':[sum], 
    'Paid': [sum], 
    'Balance': [sum], 
    'New TAT': ["mean"]
})

In [379]:
customer_summary.head()

  Bill Date   Mont           Customer Amount  Paid Balance New TAT
                                         sum   sum     sum    mean
0         3  March    Apex Technology   2475  2400      75    17.0
1         3  March      Barbara Allen   2475  2475       0    17.0
2         3  March         Blue Cross   9900  9900       0    14.0
3         3  March          Bob Vance   2475  2475       0    17.0
4         3  March  Decker Automotive   3300  3000     300    14.0

In [380]:
customer_summary.columns

MultiIndex([('Bill Date',     ''),
            (     'Mont',     ''),
            ( 'Customer',     ''),
            (   'Amount',  'sum'),
            (     'Paid',  'sum'),
            (  'Balance',  'sum'),
            (  'New TAT', 'mean')],
           )

In [381]:
customer_summary.columns = ['Bill Date',
                           'Mont', 
                            'Customer',
                           'Total Billed', 
                           'Total Paid',
                           'Balance',
                           'Turnaround Time']

In [382]:
df_k = frames['Kevin']

In [384]:
df_k.head()

,Employee,Date,Expense,Amount Requested,Justification,Amount Paid
0,Michael,2019-03-01,Gas to NY,75,Seeing Jan,75
1,Michael,2019-03-07,Gas to NY,75,Seeing Jan,75
2,Michael,2019-03-09,Gas to NY,75,Seeing Jan,75
3,Darryl,2019-03-01,Food,50,Warehouse Lunch,50
4,Michael,2019-03-15,Food,200,Dinner with Jan,150

In [385]:
df_k['Month']=df_k['Date'].dt.strftime('%B')

In [387]:
df_k.head()

,Employee,Date,Expense,Amount Requested,Justification,Amount Paid,Month
0,Michael,2019-03-01,Gas to NY,75,Seeing Jan,75,March
1,Michael,2019-03-07,Gas to NY,75,Seeing Jan,75,March
2,Michael,2019-03-09,Gas to NY,75,Seeing Jan,75,March
3,Darryl,2019-03-01,Food,50,Warehouse Lunch,50,March
4,Michael,2019-03-15,Food,200,Dinner with Jan,150,March

In [388]:
#get mont col 
df_k['Date']=df_k['Date'].dt.month

In [390]:
df_k.head()

,Employee,Date,Expense,Amount Requested,Justification,Amount Paid,Month
0,Michael,3,Gas to NY,75,Seeing Jan,75,March
1,Michael,3,Gas to NY,75,Seeing Jan,75,March
2,Michael,3,Gas to NY,75,Seeing Jan,75,March
3,Darryl,3,Food,50,Warehouse Lunch,50,March
4,Michael,3,Food,200,Dinner with Jan,150,March

In [391]:
expenses_summary = df_k.groupby(['Date','Month','Employee'], as_index=False).agg({
    'Amount Requested':[sum],
    'Amount Paid':[sum]
})

In [392]:
expenses_summary.head()

  Date  Month Employee Amount Requested Amount Paid
                                    sum         sum
0    3  March   Darryl               50          50
1    3  March  Michael              800         450
2    4  April     Andy              200         100
3    4  April   Dwight              100         100
4    4  April      Jim              100         100

In [394]:
expenses_summary.columns=['Date', 'Month','Employee','Amount Requested', 'Amount Paid']

In [395]:
expenses_summary.head()

   Date  Month Employee  Amount Requested  Amount Paid
0     3  March   Darryl                50           50
1     3  March  Michael               800          450
2     4  April     Andy               200          100
3     4  April   Dwight               100          100
4     4  April      Jim               100          100

In [396]:
expenses_summary.drop(columns=['Date'],inplace=True)

In [397]:
expenses_summary.head()

   Month Employee  Amount Requested  Amount Paid
0  March   Darryl                50           50
1  March  Michael               800          450
2  April     Andy               200          100
3  April   Dwight               100          100
4  April      Jim               100          100

## Write out to one sheet

In [403]:
output_file = os.path.join('..','data','accounting_summary.xlsx')
writer = pd.ExcelWriter(output_file, engine='xlsxwriter')
workbook = writer.book

In [398]:
header_format = workbook.add_format({
    'bold':True,
    'align':'center',
    'valign':'top',
    'font_color':'white',
    'font_size':12
})

In [399]:
number_format = workbook.add_format({ 'num_format':'#,##0.00'})

In [400]:
money_format = workbook.add_format({ 'num_format':'$#,##0.00'})

In [401]:
#conditional formatting 
red_color = workbook.add_format({
    'bg_color': '#FFC7CE',
    'font_color': '#9C0006'
})

In [405]:
sheet = 'Customer Summary'
customer_summary.to_excel(writer,sheet_name=sheet, index=False)

In [410]:
for col_num, value in enumerate(customer_summary.columns.values):
    print(col_num,value)

0 Bill Date
1 Mont
2 Customer
3 Total Billed
4 Total Paid
5 Balance
6 Turnaround Time

In [411]:
for col_num, value in enumerate(customer_summary.columns.values):
    worksheet.write(0,col_num,value, header_format)

In [412]:
worksheet.set_column('A:B', 14, None)
worksheet.set_column('C:E', 14, money_format)
worksheet.set_column('F:F', 14, number_format)

0

In [414]:
#conditional formatting 
first_row = 1
first_column = 1
last_row = len(customer_summary.index)
last_column = 4 
conditions = {
    'type':'cell',
    'criteria':'<',
    'value':0,
    'format':red_color
}
conditions

{'type': 'cell',
 'criteria': '<',
 'value': 0,
 'format': <xlsxwriter.format.Format at 0x2690a85b588>}

In [415]:
worksheet.conditional_format(first_row,
                            first_column,
                            last_row,
                            last_column,
                            conditions,)

In [423]:
#? NEED to write data 
writer.save()

## Transposed and Combining data

In [421]:
supply_file = os.path.join('..','data','supply.xlsx')

In [422]:
frames.keys()

dict_keys(['March', 'April', 'May'])

In [419]:
frames = pd.read_excel(supply_file, sheet_name=None)

In [420]:
frames['March'].head()

   Supplier  Hammermill  Weyerhouser  Georgia-Pacific  Boise  HP Card Stock
0   On-Hand          25           50               35     15             25
1  Incoming         300          300              250    250            300
2  Outgoing         250          275              200    200            300
3   Balance          75           75               85     65             25

In [427]:
def format_dataframe(frames, sheet_name):
    df = pd.DataFrame(frames[sheet_name])
    df = df.T.reset_index()
    df.columns = df.loc[0]
    df.drop([0], inplace=True)
    df['Month']=sheet_name
    return(df)

In [428]:
march_formatted = format_dataframe(frames, 'March')

In [430]:
march_formatted.head(3)

0         Supplier On-Hand Incoming Outgoing Balance  Month
1       Hammermill      25      300      250      75  March
2      Weyerhouser      50      300      275      75  March
3  Georgia-Pacific      35      250      200      85  March

## Summarize  Sheets

In [432]:
for f in frames.keys():
    print(f)

March
April
May

In [433]:
formatted_dfs =[]
for f in frames.keys():
    df = format_dataframe(frames,f)
    formatted_dfs.append(df)

In [434]:
summary_df = pd.concat(formatted_dfs, ignore_index=True )

In [435]:
summary_df.head(3)

0         Supplier On-Hand Incoming Outgoing Balance  Month
0       Hammermill      25      300      250      75  March
1      Weyerhouser      50      300      275      75  March
2  Georgia-Pacific      35      250      200      85  March

In [436]:
summary_df.tail(2)

0        Supplier On-Hand Incoming Outgoing Balance Month
13          Boise      65      200      200      65   May
14  HP Card Stock     100      250      300      50   May

In [437]:
#faster version 
formatted_dfs = [format_dataframe(frames,f) for f in frames.keys()]

In [438]:
#faster version 
summary_df = pd.concat([format_dataframe(frames,f) for f in frames.keys()], ignore_index=False)

## Full Version 
with conditional colors etc...

In [441]:
summary_df = summary_df[['Month', 'Supplier', 'Incoming', 'Outgoing', 'On-Hand']]

In [442]:
output_file = os.path.join('..', 'data', 'supply_summary.xlsx')
writer = pd.ExcelWriter(output_file, engine='xlsxwriter')
workbook = writer.book

In [ ]:
# Define the format for our header:
header_format = workbook.add_format({
    'bold': True, #Bold Font: This value must be either True or False
    'align': 'center', #Center Alignment
    'valign': 'top', #Top Alignment
    'fg_color': '#4472C1', #Cell Color
    'font_color': 'white', #Font Color
    'font_size': 12, #Font Size
})

In [ ]:
# Define the format for our numbers:
number_format = workbook.add_format({'num_format': '#,##0'})

In [440]:
good_color = workbook.add_format({'bg_color': '#C6EFCE',
                            'font_color': '#006100'})

neutral_color = workbook.add_format({'bg_color': '#FFEB9C',
                            'font_color': '#9C5700'})

bad_color = workbook.add_format({'bg_color': '#FFC7CE',
                            'font_color': '#9C0006'})

In [ ]:
# Define the sheet and write the data to Excel
sheet = 'Supply Summary'
summary_df.to_excel(writer, sheet_name=sheet, index=False)

In [ ]:
# Define the worksheet
worksheet = writer.sheets[sheet]

In [ ]:
# Write the headers to the worksheet
for col_num, value in enumerate(summary_df.columns.values):
    worksheet.write(0, col_num, value, header_format)

In [ ]:
# Set the numerical columns
worksheet.set_column('A:B', 14, None)
worksheet.set_column('C:E', 14, number_format)

In [443]:
# Define rows and columns
first_row = 1
last_row = len(summary_df.index)
incoming_column = 2
outgoing_column = 3
on_hand_column = 4


# Set the color conditions
incoming_col_condition = {
    'type': 'cell', # Because we want to apply the formatting to each individual cell
    'criteria': '>', # for greater than
    'value': 0,
    'format': good_color,
}

outgoing_col_condition = {
    'type': 'cell', 
    'criteria': '>', 
    'value': 0,
    'format': neutral_color,
}

on_hand_col_condition = {
    'type': 'cell', 
    'criteria': '<=', # for less than or equal to
    'value': 25,
    'format': bad_color,
}

In [ ]:
# Apply the color formats

# Incoming Column
worksheet.conditional_format(first_row,
                            incoming_column,
                            last_row,
                            incoming_column,
                            incoming_col_condition)

# Outgoing Column
worksheet.conditional_format(first_row,
                            outgoing_column,
                            last_row,
                            outgoing_column,
                            outgoing_col_condition)
# On Hand Column
worksheet.conditional_format(first_row,
                            on_hand_column,
                            last_row,
                            on_hand_column,
                            on_hand_col_condition)

In [ ]:
writer.save()

In [ ]:
## Filtering

In [444]:
# Define the path to the file
hr_file = os.path.join('..', 'data', 'hr_report.xlsx')

In [445]:
frames = pd.read_excel(hr_file, sheet_name=None)

In [446]:
df = pd.DataFrame(frames['Sheet1'])

In [447]:
df.head()

,Date,Reporter,Employee,Complaint
0,2019-03-01,Michael,Toby,Toby is horrible
1,2019-03-02,Dwight,Jim,Jim encased my stapler in Jello
2,2019-03-03,Andy,Jim,Jim hid my phone in the ceiling
3,2019-03-05,Dwight,Jim,I hit myself in the head with my phone
4,2019-03-09,Dwight,Jim,Jim jammed all of my desk drawers so I could o...

In [448]:
# Generating a unique list of all employees
reporters = df['Reporter'].unique()

# Add the
employees = df['Employee'].unique()

# Combine the lists
all_employees = list(reporters) + list(employees)

# Convert the list to a set
all_employees = list(set(all_employees))

In [449]:
all_employees

['Toby',
 'Angela',
 'Michael',
 'Phyllis',
 'Jim',
 'Daryl',
 'Oscar',
 'Dwight',
 'Ryan',
 'Pam',
 'Andy',
 'Stanley']

In [450]:
df['Month'] = df['Date'].dt.strftime('%B')

In [451]:
# Get the Data
df.loc[(df['Reporter'] == 'Phyllis') & (df['Month'] == 'May')]

         Date Reporter Employee                         Complaint Month
25 2019-05-20  Phyllis     Andy  Andy's talks like a baby all day   May

In [452]:
# Get a Count from that data:
len(df.loc[(df['Reporter'] == 'Phyllis') & (df['Month'] == 'May')])

1

In [453]:
month = 'March'

# Create and empty dictionary to hold our data
summary_data = {}

# Loop through our employee list with our conditions
for employee in all_employees:
    complaints_made = len(df.loc[(df['Reporter'] == employee) & (df['Month'] == month)])
    complaints_received = len(df.loc[(df['Employee'] == employee) & (df['Month'] == month)])
    
    # Update the dictionary with the information for that employee
    summary_data[employee] = {'complaints_made': complaints_made, 'complaints_received': complaints_received}

In [455]:
 summary_data

{'Toby': {'complaints_made': 0, 'complaints_received': 1},
 'Angela': {'complaints_made': 0, 'complaints_received': 0},
 'Michael': {'complaints_made': 1, 'complaints_received': 1},
 'Phyllis': {'complaints_made': 0, 'complaints_received': 0},
 'Jim': {'complaints_made': 0, 'complaints_received': 5},
 'Daryl': {'complaints_made': 0, 'complaints_received': 0},
 'Oscar': {'complaints_made': 1, 'complaints_received': 0},
 'Dwight': {'complaints_made': 4, 'complaints_received': 0},
 'Ryan': {'complaints_made': 0, 'complaints_received': 0},
 'Pam': {'complaints_made': 0, 'complaints_received': 0},
 'Andy': {'complaints_made': 1, 'complaints_received': 0},
 'Stanley': {'complaints_made': 0, 'complaints_received': 0}}

In [458]:
pd.DataFrame(summary_data).head()

,Toby,Angela,Michael,Phyllis,Jim,Daryl,Oscar,Dwight,Ryan,Pam,Andy,Stanley
complaints_made,0,0,1,0,0,0,1,4,0,0,1,0
complaints_received,1,0,1,0,5,0,0,0,0,0,0,0

In [459]:
pd.DataFrame(summary_data).T.head()

         complaints_made  complaints_received
Toby                   0                    1
Angela                 0                    0
Michael                1                    1
Phyllis                0                    0
Jim                    0                    5

In [457]:
def summarize_hr_data(df, month, employees):
    '''Summarizes HR data by Month'''
    # Create and empty dictionary to hold our data
    summary_data = {}
    # Loop through our employee list with our conditions
    for employee in employees:
        complaints_made = len(df.loc[(df['Reporter'] == employee) & (df['Month'] == month)])
        complaints_received = len(df.loc[(df['Employee'] == employee) & (df['Month'] == month)])
        summary_data[employee] = {'complaints_made': complaints_made, 'complaints_received': complaints_received}
    
    # Transpose the data
    tmp_df = pd.DataFrame(summary_data).T
    
    # Add the Month column
    tmp_df['Month'] = month
    
    # We also need to give it an index
    tmp_df.reset_index(inplace=True)
    
    # return the DataFrame
    return tmp_df

In [460]:
summarize_hr_data(df, 'March', all_employees).head()

     index  complaints_made  complaints_received  Month
0     Toby                0                    1  March
1   Angela                0                    0  March
2  Michael                1                    1  March
3  Phyllis                0                    0  March
4      Jim                0                    5  March

In [461]:
# Concat the DataFrames
hr_summary_df = pd.concat([summarize_hr_data(df, month, employees) for month in df['Month'].unique()], 
                          ignore_index=True)

In [462]:
hr_summary_df

      index  complaints_made  complaints_received  Month
0      Toby                0                    1  March
1       Jim                0                    5  March
2   Michael                1                    1  March
3       Pam                0                    0  March
4    Dwight                4                    0  March
5      Andy                1                    0  March
6      Ryan                0                    0  March
7      Toby                0                    1  April
8       Jim                0                    4  April
9   Michael                1                    0  April
10      Pam                0                    1  April
11   Dwight                5                    1  April
12     Andy                1                    1  April
13     Ryan                0                    0  April
14     Toby                1                    1    May
15      Jim                0                    5    May
16  Michael                1                    1    May
17      Pam                0                    1    May
18   Dwight                5                    1    May
19     Andy                1                    1    May
20     Ryan                0                    1    May

In [463]:
hr_summary_df = hr_summary_df.loc[(hr_summary_df['complaints_made'] > 0) | (hr_summary_df['complaints_received'] > 0)]

In [464]:
hr_summary_df

      index  complaints_made  complaints_received  Month
0      Toby                0                    1  March
1       Jim                0                    5  March
2   Michael                1                    1  March
4    Dwight                4                    0  March
5      Andy                1                    0  March
7      Toby                0                    1  April
8       Jim                0                    4  April
9   Michael                1                    0  April
10      Pam                0                    1  April
11   Dwight                5                    1  April
12     Andy                1                    1  April
14     Toby                1                    1    May
15      Jim                0                    5    May
16  Michael                1                    1    May
17      Pam                0                    1    May
18   Dwight                5                    1    May
19     Andy                1                    1    May
20     Ryan                0                    1    May

In [465]:
# Let's rename and reorder our columns:
hr_summary_df.columns = ['Employee', 'Complaints Made', 'Complaints Received', 'Month']

In [466]:
r_summary_df = hr_summary_df[['Month', 'Employee', 'Complaints Made', 'Complaints Received']]

In [467]:
hr_summary_df

   Employee  Complaints Made  Complaints Received  Month
0      Toby                0                    1  March
1       Jim                0                    5  March
2   Michael                1                    1  March
4    Dwight                4                    0  March
5      Andy                1                    0  March
7      Toby                0                    1  April
8       Jim                0                    4  April
9   Michael                1                    0  April
10      Pam                0                    1  April
11   Dwight                5                    1  April
12     Andy                1                    1  April
14     Toby                1                    1    May
15      Jim                0                    5    May
16  Michael                1                    1    May
17      Pam                0                    1    May
18   Dwight                5                    1    May
19     Andy                1                    1    May
20     Ryan                0                    1    May

In [468]:
df.loc[(df['Employee'] == 'Jim') & (df['Month'] == 'March')]

,Date,Reporter,Employee,Complaint,Month
1,2019-03-02,Dwight,Jim,Jim encased my stapler in Jello,March
2,2019-03-03,Andy,Jim,Jim hid my phone in the ceiling,March
3,2019-03-05,Dwight,Jim,I hit myself in the head with my phone,March
4,2019-03-09,Dwight,Jim,Jim jammed all of my desk drawers so I could o...,March
6,2019-03-17,Dwight,Jim,Jim stole my identity,March

In [470]:
def get_complaint_details(df, month, employees):
    '''Gets the complaint details if the employee had more than three complaints in a month'''
    # Create an empty list to hold our DataFrames
    frames = []
    # Loop through our employee list with our conditions
    for employee in employees:
        complaints_received = df.loc[(df['Employee'] == employee) & (df['Month'] == month)]
        # IF there were three or more complaints:
        if len(complaints_received) >= 3:
            frames.append(pd.DataFrame(complaints_received))
    df = pd.concat(frames, ignore_index=True)
    
    return df

In [475]:
df.head(2)
month
employees[:2]

array(['Toby', 'Jim'], dtype=object)

In [ ]:
get_complaint_details(df, month, employees)

In [476]:
hr_df =  pd.concat([get_complaint_details(df, month, all_employees) for month in df['Month'].unique()], 
                       ignore_index=False)

In [477]:
hr_df.head(3)

        Date Reporter Employee                               Complaint  Month
0 2019-03-02   Dwight      Jim         Jim encased my stapler in Jello  March
1 2019-03-03     Andy      Jim         Jim hid my phone in the ceiling  March
2 2019-03-05   Dwight      Jim  I hit myself in the head with my phone  March

 ## Combining reports

In [481]:
# Define the path to the file
combined_report = os.path.join('..', 'data', 'combined_report.xlsx')

In [483]:
# Read the file into our notebook
frames = pd.read_excel(combined_report, sheet_name=None)

In [485]:
frames.keys()

dict_keys(['Sales', 'Billing', 'Supply', 'HR', 'HR Detail'])

In [486]:
# Summarize the Sales Data
sales_summary = pd.DataFrame(frames['Sales']).groupby(['Month'], as_index=False).agg({\
    'Amt': [sum],
    'Commission': [sum]
})

In [487]:
sales_summary

   Month     Amt Commission
             sum        sum
0  April   92575   13886.25
1  March  125625   18843.75
2    May   73250   10987.50

In [488]:
# Rename the columns
sales_summary.columns = ['Month', 'Sales Amount', 'Sales Commission']

In [489]:
sales_summary  #sort in calendar order

   Month  Sales Amount  Sales Commission
0  April         92575          13886.25
1  March        125625          18843.75
2    May         73250          10987.50

In [490]:
# Define the category
sales_summary['Month'] = pd.Categorical(sales_summary['Month'], ['March', 'April', 'May'])

In [491]:
# Sort the values
sales_summary.sort_values(by=['Month'], inplace=True)

In [492]:
# Preview our data
sales_summary.head()

   Month  Sales Amount  Sales Commission
1  March        125625          18843.75
0  April         92575          13886.25
2    May         73250          10987.50

In [493]:
billing_summary = pd.DataFrame(frames['Billing']).groupby(['Month'], as_index=False).agg({ \
    'Total Billed': [sum],
    'Total Paid': [sum],
})

In [494]:
billing_summary.head(2)

   Month Total Billed Total Paid
                  sum        sum
0  April        61100      59800
1  March        82912      69587

In [495]:
billing_summary.columns = ['Month', 'Amount Billed', 'Amount Paid']

In [496]:
billing_summary['Month'] = pd.Categorical(billing_summary['Month'], ['March', 'April', 'May'])

In [497]:
billing_summary.sort_values(by=['Month'], inplace=True)

In [498]:
billing_summary['Outstanding Balance'] = billing_summary['Amount Billed'] - billing_summary['Amount Paid']

In [499]:
billing_summary.head()

   Month  Amount Billed  Amount Paid  Outstanding Balance
1  March          82912        69587                13325
0  April          61100        59800                 1300
2    May          48345        45980                 2365

In [500]:
supply_summary = pd.DataFrame(frames['Supply']).groupby(['Month'], as_index=False).agg({
    'Incoming': [sum],
    'Outgoing': [sum],
    'On-Hand': [sum],
})

In [501]:
supply_summary.columns = ['Month', 'Supply - Incoming', 'Supply - Outgoing', 'Supply - On-Hand']

In [502]:
supply_summary['Month'] = pd.Categorical(supply_summary['Month'], ['March', 'April', 'May'])

In [503]:
supply_summary.sort_values(by=['Month'], inplace=True)

In [504]:
supply_summary.head()

   Month  Supply - Incoming  Supply - Outgoing  Supply - On-Hand
1  March               1400               1225               150
0  April               1200               1150               325
2    May               1075               1225               375

In [505]:
hr_summary = pd.DataFrame(frames['HR']).groupby(['Month'], as_index=False).agg({
    'Complaints Received': [sum],
})

In [506]:
hr_summary.columns = ['Month', 'HR Incidents']

In [507]:
hr_summary['Month'] = pd.Categorical(hr_summary['Month'], ['March', 'April', 'May'])

In [508]:
hr_summary.sort_values(by=['Month'], inplace=True)

In [509]:
hr_summary.head()

   Month  HR Incidents
1  March             7
0  April             8
2    May            11

## Horizontal concat

In [510]:
summary_df = pd.concat([sales_summary, billing_summary, supply_summary, hr_summary], axis=1).\
                T.drop_duplicates().T

In [511]:
summary_df.head()

,Month,Sales Amount,Sales Commission,Amount Billed,Amount Paid,Outstanding Balance,Supply - Incoming,Supply - Outgoing,Supply - On-Hand,HR Incidents
1,March,125625,18843.8,82912,69587,13325,1400,1225,150,7
0,April,92575,13886.2,61100,59800,1300,1200,1150,325,8
2,May,73250,10987.5,48345,45980,2365,1075,1225,375,11

In [512]:
summary_df.info() #all objects

<class 'pandas.core.frame.DataFrame'>
Int64Index: 3 entries, 1 to 2
Data columns (total 10 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Month                3 non-null      object
 1   Sales Amount         3 non-null      object
 2   Sales Commission     3 non-null      object
 3   Amount Billed        3 non-null      object
 4   Amount Paid          3 non-null      object
 5   Outstanding Balance  3 non-null      object
 6   Supply - Incoming    3 non-null      object
 7   Supply - Outgoing    3 non-null      object
 8   Supply - On-Hand     3 non-null      object
 9   HR Incidents         3 non-null      object
dtypes: object(10)
memory usage: 344.0+ bytes

In [513]:
cols = summary_df.columns

In [514]:
# Convert the columns to a Numeric type
summary_df[cols] = summary_df[cols].apply(pd.to_numeric, errors='ignore')

In [515]:
# Verify the type conversion worked
summary_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 3 entries, 1 to 2
Data columns (total 10 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Month                3 non-null      object
 1   Sales Amount         3 non-null      int64
 2   Sales Commission     3 non-null      float64
 3   Amount Billed        3 non-null      int64
 4   Amount Paid          3 non-null      int64
 5   Outstanding Balance  3 non-null      int64
 6   Supply - Incoming    3 non-null      int64
 7   Supply - Outgoing    3 non-null      int64
 8   Supply - On-Hand     3 non-null      int64
 9   HR Incidents         3 non-null      int64
dtypes: float64(1), int64(8), object(1)
memory usage: 344.0+ bytes

In [516]:
# Set 'Month' as the index
summary_df.set_index('Month', inplace=True)

In [517]:
summary_df.head()

,Sales Amount,Sales Commission,Amount Billed,Amount Paid,Outstanding Balance,Supply - Incoming,Supply - Outgoing,Supply - On-Hand,HR Incidents
Month,,,,,,,,,
March,125625,18843.75,82912,69587,13325,1400,1225,150,7
April,92575,13886.25,61100,59800,1300,1200,1150,325,8
May,73250,10987.50,48345,45980,2365,1075,1225,375,11

In [518]:
# Create a 'Total' row
summary_df.loc["Total"] = summary_df.sum()

In [519]:
summary_df.head()

,Sales Amount,Sales Commission,Amount Billed,Amount Paid,Outstanding Balance,Supply - Incoming,Supply - Outgoing,Supply - On-Hand,HR Incidents
Month,,,,,,,,,
March,125625.0,18843.75,82912.0,69587.0,13325.0,1400.0,1225.0,150.0,7.0
April,92575.0,13886.25,61100.0,59800.0,1300.0,1200.0,1150.0,325.0,8.0
May,73250.0,10987.50,48345.0,45980.0,2365.0,1075.0,1225.0,375.0,11.0
Total,291450.0,43717.50,192357.0,175367.0,16990.0,3675.0,3600.0,850.0,26.0

In [520]:
# Now let's preview our data
summary_df.head()

,Sales Amount,Sales Commission,Amount Billed,Amount Paid,Outstanding Balance,Supply - Incoming,Supply - Outgoing,Supply - On-Hand,HR Incidents
Month,,,,,,,,,
March,125625.0,18843.75,82912.0,69587.0,13325.0,1400.0,1225.0,150.0,7.0
April,92575.0,13886.25,61100.0,59800.0,1300.0,1200.0,1150.0,325.0,8.0
May,73250.0,10987.50,48345.0,45980.0,2365.0,1075.0,1225.0,375.0,11.0
Total,291450.0,43717.50,192357.0,175367.0,16990.0,3675.0,3600.0,850.0,26.0

In [521]:
# Reset the index
summary_df.reset_index(inplace=True)

In [522]:
summary_df.head()

,Month,Sales Amount,Sales Commission,Amount Billed,Amount Paid,Outstanding Balance,Supply - Incoming,Supply - Outgoing,Supply - On-Hand,HR Incidents
0,March,125625.0,18843.75,82912.0,69587.0,13325.0,1400.0,1225.0,150.0,7.0
1,April,92575.0,13886.25,61100.0,59800.0,1300.0,1200.0,1150.0,325.0,8.0
2,May,73250.0,10987.50,48345.0,45980.0,2365.0,1075.0,1225.0,375.0,11.0
3,Total,291450.0,43717.50,192357.0,175367.0,16990.0,3675.0,3600.0,850.0,26.0

## Write out Excel 
formatting..

In [531]:
output_file = os.path.join('..', 'data', 'Quarterly Report.xlsx')
writer = pd.ExcelWriter(output_file, engine='xlsxwriter')
workbook = writer.book

In [532]:
# Define the format for our header:
title_format = workbook.add_format({
    'bold': True, 
    'align': 'center', 
    'valign': 'top',
    'fg_color': '#4472C1',
    'font_color': 'white',
    'font_size': 16,
})

header_format = workbook.add_format({
    'bold': True,
    'align': 'center',
    'valign': 'top',
    'fg_color': '#4472C1',
    'font_color': 'white',
    'font_size': 12,
})

# Define the subheader format:
subheader_format = workbook.add_format({
            'bold': False,
            'align': 'center',
            'valign': 'top',
            'fg_color': '#8EA9DB',
            'font_color': 'black',
            'text_wrap': 1,
            'border': 1})

# Define the format for our numbers:
number_format = workbook.add_format({'num_format': '#,##0'})
accounting_format = workbook.add_format({'num_format': '$#,##0'})

In [533]:
# Get the column number for month
month_column = list(summary_df.columns).index('Month')

# Get the column numbers for accounting columns
accounting_start = list(summary_df.columns).index('Sales Amount')
accounting_end = list(summary_df.columns).index('Outstanding Balance')

# Get the number column numbers
num_start = list(summary_df.columns).index('Supply - Incoming')
num_end = list(summary_df.columns).index('HR Incidents')

In [534]:
# Set the column formats

# Month Column
worksheet.set_column(month_column, month_column, 14, None)

# Accounting Columns
worksheet.set_column(accounting_start, accounting_end, 14, accounting_format)

# Number Columns
worksheet.set_column(num_start, num_end, 14, number_format)

0

In [535]:
# Writing the Headers
worksheet.merge_range(0, 0, 0, len(summary_df.columns)-1, 'Dunder Mifflin Scranton', title_format)
worksheet.merge_range(1, 0, 1, len(summary_df.columns)-1, 'Quarterly Summary', subheader_format)

## Charting

In [543]:
chart_columns = ['Sales Amount', 'Amount Billed', 'Amount Paid']
category_column = 0
first_row = 3
last_row = 5

In [544]:
simple_chart = workbook.add_chart({'type': 'column'})

In [545]:
# Remember, for categories and values the order is [sheetname, first_row, first_col, last_row, last_col]
for col in chart_columns:
    # Get the column number of the data we want to add
    col_num = list(summary_df.columns).index(col)
    # Add the series
    simple_chart.add_series({
        'name': col,
        'categories': [sheet, first_row, category_column, last_row, category_column],
        'values': [sheet, first_row, col_num, last_row, col_num]
    })

In [546]:
# Set the chart title
simple_chart.set_title({'name': 'Simple Bar Chart'})

In [547]:
worksheet.insert_chart('A9', simple_chart)

In [548]:
# Save the file
writer.save()

## Permutations

In [153]:
# Function to print permutations of string 
# This function takes three parameters: 
# 1. String 
# 2. Starting index of the string 
# 3. Ending index of the string. 
def permute(a, l, r): 
    if l==r: 
        print(a) 
    else: 
        for i in range(l,r+1): 
            a[l], a[i] = a[i], a[l] 
            permute(a, l+1, r) 
            a[l], a[i] = a[i], a[l] # backtrack

In [154]:
string = "ABC"
n = len(string) 
a = list(string) 
permute(a, 0, n-1)

['A', 'B', 'C']
['A', 'C', 'B']
['B', 'A', 'C']
['B', 'C', 'A']
['C', 'B', 'A']
['C', 'A', 'B']

In [155]:
string = "AB"
n = len(string) 
a = list(string) 
permute(a, 0, n-1)

['A', 'B']
['B', 'A']

In [156]:
import itertools
itertools.permutations([1,2,3])

In [163]:
p = list(itertools.permutations([1,2,3], 3))
print(p)

[(1, 2, 3), (1, 3, 2), (2, 1, 3), (2, 3, 1), (3, 1, 2), (3, 2, 1)]

In [201]:
perm_list = []
count = 0 
for x in range(5):
    #print(x)
    p = list(itertools.permutations([1,2,3,4], x))
    p_len = len(p)
    print(p_len)
    count = count +p_len 
    perm_list.append(p)
print(count-1)

1
4
12
24
24
64

In [202]:
p

[(1, 2, 3, 4),
 (1, 2, 4, 3),
 (1, 3, 2, 4),
 (1, 3, 4, 2),
 (1, 4, 2, 3),
 (1, 4, 3, 2),
 (2, 1, 3, 4),
 (2, 1, 4, 3),
 (2, 3, 1, 4),
 (2, 3, 4, 1),
 (2, 4, 1, 3),
 (2, 4, 3, 1),
 (3, 1, 2, 4),
 (3, 1, 4, 2),
 (3, 2, 1, 4),
 (3, 2, 4, 1),
 (3, 4, 1, 2),
 (3, 4, 2, 1),
 (4, 1, 2, 3),
 (4, 1, 3, 2),
 (4, 2, 1, 3),
 (4, 2, 3, 1),
 (4, 3, 1, 2),
 (4, 3, 2, 1)]

In [203]:
p_len

24

In [205]:
p = list(itertools.permutations([1,2,3,4], 4))
perm_list.append(p)

In [209]:
perm_list[:3]

[[()],
 [(1,), (2,), (3,), (4,)],
 [(1, 2),
  (1, 3),
  (1, 4),
  (2, 1),
  (2, 3),
  (2, 4),
  (3, 1),
  (3, 2),
  (3, 4),
  (4, 1),
  (4, 2),
  (4, 3)]]

In [216]:
len(perm_list[3])

24

In [217]:
from functools import reduce # only in Python 3

In [218]:
import operator
l = [[1,2,3],[4,5,6], [7], [8,9]]
reduce(operator.concat, l)
[1, 2, 3, 4, 5, 6, 7, 8, 9]

[1, 2, 3, 4, 5, 6, 7, 8, 9]

In [220]:
flatten_perms = reduce(operator.concat, perm_list)
flatten_perms

[(),
 (1,),
 (2,),
 (3,),
 (4,),
 (1, 2),
 (1, 3),
 (1, 4),
 (2, 1),
 (2, 3),
 (2, 4),
 (3, 1),
 (3, 2),
 (3, 4),
 (4, 1),
 (4, 2),
 (4, 3),
 (1, 2, 3),
 (1, 2, 4),
 (1, 3, 2),
 (1, 3, 4),
 (1, 4, 2),
 (1, 4, 3),
 (2, 1, 3),
 (2, 1, 4),
 (2, 3, 1),
 (2, 3, 4),
 (2, 4, 1),
 (2, 4, 3),
 (3, 1, 2),
 (3, 1, 4),
 (3, 2, 1),
 (3, 2, 4),
 (3, 4, 1),
 (3, 4, 2),
 (4, 1, 2),
 (4, 1, 3),
 (4, 2, 1),
 (4, 2, 3),
 (4, 3, 1),
 (4, 3, 2),
 (1, 2, 3, 4),
 (1, 2, 4, 3),
 (1, 3, 2, 4),
 (1, 3, 4, 2),
 (1, 4, 2, 3),
 (1, 4, 3, 2),
 (2, 1, 3, 4),
 (2, 1, 4, 3),
 (2, 3, 1, 4),
 (2, 3, 4, 1),
 (2, 4, 1, 3),
 (2, 4, 3, 1),
 (3, 1, 2, 4),
 (3, 1, 4, 2),
 (3, 2, 1, 4),
 (3, 2, 4, 1),
 (3, 4, 1, 2),
 (3, 4, 2, 1),
 (4, 1, 2, 3),
 (4, 1, 3, 2),
 (4, 2, 1, 3),
 (4, 2, 3, 1),
 (4, 3, 1, 2),
 (4, 3, 2, 1),
 (1,),
 (2,),
 (3,),
 (1, 2, 3, 4),
 (1, 2, 4, 3),
 (1, 3, 2, 4),
 (1, 3, 4, 2),
 (1, 4, 2, 3),
 (1, 4, 3, 2),
 (2, 1, 3, 4),
 (2, 1, 4, 3),
 (2, 3, 1, 4),
 (2, 3, 4, 1),
 (2, 4, 1, 3),
 (2, 4, 3, 1),
 (3, 1, 2, 4),
 (3, 1, 4, 2),
 (3, 2, 1, 4),
 (3, 2, 4, 1),
 (3, 4, 1, 2),
 (3, 4, 2, 1),
 (4, 1, 2, 3),
 (4, 1, 3, 2),
 (4, 2, 1, 3),
 (4, 2, 3, 1),
 (4, 3, 1, 2),
 (4, 3, 2, 1)]

In [221]:
len(flatten_perms)

92

In [242]:
c =['Workers','Clients']  #2 example columns

In [245]:
list(itertools.permutations(c, 1))

[('Workers',), ('Clients',)]

In [246]:
list(itertools.permutations(c, 2))

[('Workers', 'Clients'), ('Clients', 'Workers')]

In [239]:
cc =['Workers','Clients','Region','Warehouse']  #4 example columns

In [241]:
list(itertools.permutations(cc, 1))

[('Workers',), ('Clients',), ('Region',), ('Warehouse',)]

In [235]:
list(itertools.permutations(cc, 2))

[('Workers', 'Clients'),
 ('Workers', 'Region'),
 ('Workers', 'Warehouse'),
 ('Clients', 'Workers'),
 ('Clients', 'Region'),
 ('Clients', 'Warehouse'),
 ('Region', 'Workers'),
 ('Region', 'Clients'),
 ('Region', 'Warehouse'),
 ('Warehouse', 'Workers'),
 ('Warehouse', 'Clients'),
 ('Warehouse', 'Region')]

In [237]:
list(itertools.permutations(cc, 3))

[('Workers', 'Clients', 'Region'),
 ('Workers', 'Clients', 'Warehouse'),
 ('Workers', 'Region', 'Clients'),
 ('Workers', 'Region', 'Warehouse'),
 ('Workers', 'Warehouse', 'Clients'),
 ('Workers', 'Warehouse', 'Region'),
 ('Clients', 'Workers', 'Region'),
 ('Clients', 'Workers', 'Warehouse'),
 ('Clients', 'Region', 'Workers'),
 ('Clients', 'Region', 'Warehouse'),
 ('Clients', 'Warehouse', 'Workers'),
 ('Clients', 'Warehouse', 'Region'),
 ('Region', 'Workers', 'Clients'),
 ('Region', 'Workers', 'Warehouse'),
 ('Region', 'Clients', 'Workers'),
 ('Region', 'Clients', 'Warehouse'),
 ('Region', 'Warehouse', 'Workers'),
 ('Region', 'Warehouse', 'Clients'),
 ('Warehouse', 'Workers', 'Clients'),
 ('Warehouse', 'Workers', 'Region'),
 ('Warehouse', 'Clients', 'Workers'),
 ('Warehouse', 'Clients', 'Region'),
 ('Warehouse', 'Region', 'Workers'),
 ('Warehouse', 'Region', 'Clients')]

In [238]:
list(itertools.permutations(cc, 4))

[('Workers', 'Clients', 'Region', 'Warehouse'),
 ('Workers', 'Clients', 'Warehouse', 'Region'),
 ('Workers', 'Region', 'Clients', 'Warehouse'),
 ('Workers', 'Region', 'Warehouse', 'Clients'),
 ('Workers', 'Warehouse', 'Clients', 'Region'),
 ('Workers', 'Warehouse', 'Region', 'Clients'),
 ('Clients', 'Workers', 'Region', 'Warehouse'),
 ('Clients', 'Workers', 'Warehouse', 'Region'),
 ('Clients', 'Region', 'Workers', 'Warehouse'),
 ('Clients', 'Region', 'Warehouse', 'Workers'),
 ('Clients', 'Warehouse', 'Workers', 'Region'),
 ('Clients', 'Warehouse', 'Region', 'Workers'),
 ('Region', 'Workers', 'Clients', 'Warehouse'),
 ('Region', 'Workers', 'Warehouse', 'Clients'),
 ('Region', 'Clients', 'Workers', 'Warehouse'),
 ('Region', 'Clients', 'Warehouse', 'Workers'),
 ('Region', 'Warehouse', 'Workers', 'Clients'),
 ('Region', 'Warehouse', 'Clients', 'Workers'),
 ('Warehouse', 'Workers', 'Clients', 'Region'),
 ('Warehouse', 'Workers', 'Region', 'Clients'),
 ('Warehouse', 'Clients', 'Workers', 'Region'),
 ('Warehouse', 'Clients', 'Region', 'Workers'),
 ('Warehouse', 'Region', 'Workers', 'Clients'),
 ('Warehouse', 'Region', 'Clients', 'Workers')]

In [260]:
perm_list = []
print(cc)
count = 0 
for x in range(5):
    #print(x)
    p = list(itertools.permutations(cc, x))
    p_len = len(p)
    print(p_len)
    count = count +p_len 
    perm_list.append(p)
    print(perm_list)
print(count-1)

['Workers', 'Clients', 'Region', 'Warehouse']
1
[[()]]
4
[[()], [('Workers',), ('Clients',), ('Region',), ('Warehouse',)]]
12
[[()], [('Workers',), ('Clients',), ('Region',), ('Warehouse',)], [('Workers', 'Clients'), ('Workers', 'Region'), ('Workers', 'Warehouse'), ('Clients', 'Workers'), ('Clients', 'Region'), ('Clients', 'Warehouse'), ('Region', 'Workers'), ('Region', 'Clients'), ('Region', 'Warehouse'), ('Warehouse', 'Workers'), ('Warehouse', 'Clients'), ('Warehouse', 'Region')]]
24
[[()], [('Workers',), ('Clients',), ('Region',), ('Warehouse',)], [('Workers', 'Clients'), ('Workers', 'Region'), ('Workers', 'Warehouse'), ('Clients', 'Workers'), ('Clients', 'Region'), ('Clients', 'Warehouse'), ('Region', 'Workers'), ('Region', 'Clients'), ('Region', 'Warehouse'), ('Warehouse', 'Workers'), ('Warehouse', 'Clients'), ('Warehouse', 'Region')], [('Workers', 'Clients', 'Region'), ('Workers', 'Clients', 'Warehouse'), ('Workers', 'Region', 'Clients'), ('Workers', 'Region', 'Warehouse'), ('Workers', 'Warehouse', 'Clients'), ('Workers', 'Warehouse', 'Region'), ('Clients', 'Workers', 'Region'), ('Clients', 'Workers', 'Warehouse'), ('Clients', 'Region', 'Workers'), ('Clients', 'Region', 'Warehouse'), ('Clients', 'Warehouse', 'Workers'), ('Clients', 'Warehouse', 'Region'), ('Region', 'Workers', 'Clients'), ('Region', 'Workers', 'Warehouse'), ('Region', 'Clients', 'Workers'), ('Region', 'Clients', 'Warehouse'), ('Region', 'Warehouse', 'Workers'), ('Region', 'Warehouse', 'Clients'), ('Warehouse', 'Workers', 'Clients'), ('Warehouse', 'Workers', 'Region'), ('Warehouse', 'Clients', 'Workers'), ('Warehouse', 'Clients', 'Region'), ('Warehouse', 'Region', 'Workers'), ('Warehouse', 'Region', 'Clients')]]
24
[[()], [('Workers',), ('Clients',), ('Region',), ('Warehouse',)], [('Workers', 'Clients'), ('Workers', 'Region'), ('Workers', 'Warehouse'), ('Clients', 'Workers'), ('Clients', 'Region'), ('Clients', 'Warehouse'), ('Region', 'Workers'), ('Region', 'Clients'), ('Region', 'Warehouse'), ('Warehouse', 'Workers'), ('Warehouse', 'Clients'), ('Warehouse', 'Region')], [('Workers', 'Clients', 'Region'), ('Workers', 'Clients', 'Warehouse'), ('Workers', 'Region', 'Clients'), ('Workers', 'Region', 'Warehouse'), ('Workers', 'Warehouse', 'Clients'), ('Workers', 'Warehouse', 'Region'), ('Clients', 'Workers', 'Region'), ('Clients', 'Workers', 'Warehouse'), ('Clients', 'Region', 'Workers'), ('Clients', 'Region', 'Warehouse'), ('Clients', 'Warehouse', 'Workers'), ('Clients', 'Warehouse', 'Region'), ('Region', 'Workers', 'Clients'), ('Region', 'Workers', 'Warehouse'), ('Region', 'Clients', 'Workers'), ('Region', 'Clients', 'Warehouse'), ('Region', 'Warehouse', 'Workers'), ('Region', 'Warehouse', 'Clients'), ('Warehouse', 'Workers', 'Clients'), ('Warehouse', 'Workers', 'Region'), ('Warehouse', 'Clients', 'Workers'), ('Warehouse', 'Clients', 'Region'), ('Warehouse', 'Region', 'Workers'), ('Warehouse', 'Region', 'Clients')], [('Workers', 'Clients', 'Region', 'Warehouse'), ('Workers', 'Clients', 'Warehouse', 'Region'), ('Workers', 'Region', 'Clients', 'Warehouse'), ('Workers', 'Region', 'Warehouse', 'Clients'), ('Workers', 'Warehouse', 'Clients', 'Region'), ('Workers', 'Warehouse', 'Region', 'Clients'), ('Clients', 'Workers', 'Region', 'Warehouse'), ('Clients', 'Workers', 'Warehouse', 'Region'), ('Clients', 'Region', 'Workers', 'Warehouse'), ('Clients', 'Region', 'Warehouse', 'Workers'), ('Clients', 'Warehouse', 'Workers', 'Region'), ('Clients', 'Warehouse', 'Region', 'Workers'), ('Region', 'Workers', 'Clients', 'Warehouse'), ('Region', 'Workers', 'Warehouse', 'Clients'), ('Region', 'Clients', 'Workers', 'Warehouse'), ('Region', 'Clients', 'Warehouse', 'Workers'), ('Region', 'Warehouse', 'Workers', 'Clients'), ('Region', 'Warehouse', 'Clients', 'Workers'), ('Warehouse', 'Workers', 'Clients', 'Region'), ('Warehouse', 'Workers', 'Region', 'Clients'), ('Warehouse', 'Clients', 'Workers', 'Region'), ('Warehouse', 'Clients', 'Region', 'Workers'), ('Warehouse', 'Region', 'Workers', 'Clients'), ('Warehouse', 'Region', 'Clients', 'Workers')]]
64

In [253]:
len(perm_list)

4

In [265]:
perm_list[2]

[('Workers', 'Clients'),
 ('Workers', 'Region'),
 ('Workers', 'Warehouse'),
 ('Clients', 'Workers'),
 ('Clients', 'Region'),
 ('Clients', 'Warehouse'),
 ('Region', 'Workers'),
 ('Region', 'Clients'),
 ('Region', 'Warehouse'),
 ('Warehouse', 'Workers'),
 ('Warehouse', 'Clients'),
 ('Warehouse', 'Region')]

In [268]:

for n in range(len(perm_list[2])):
    print(n,)

0
1
2
3
4
5
6
7
8
9
10
11

In [269]:
perm_list[2][2]

('Workers', 'Warehouse')

In [277]:

for n in range(len(perm_list[2])):
    v = perm_list[2][n]
    print(v, type(v), list(v))

('Workers', 'Clients') <class 'tuple'> ['Workers', 'Clients']
('Workers', 'Region') <class 'tuple'> ['Workers', 'Region']
('Workers', 'Warehouse') <class 'tuple'> ['Workers', 'Warehouse']
('Clients', 'Workers') <class 'tuple'> ['Clients', 'Workers']
('Clients', 'Region') <class 'tuple'> ['Clients', 'Region']
('Clients', 'Warehouse') <class 'tuple'> ['Clients', 'Warehouse']
('Region', 'Workers') <class 'tuple'> ['Region', 'Workers']
('Region', 'Clients') <class 'tuple'> ['Region', 'Clients']
('Region', 'Warehouse') <class 'tuple'> ['Region', 'Warehouse']
('Warehouse', 'Workers') <class 'tuple'> ['Warehouse', 'Workers']
('Warehouse', 'Clients') <class 'tuple'> ['Warehouse', 'Clients']
('Warehouse', 'Region') <class 'tuple'> ['Warehouse', 'Region']

In [279]:
v, type(v)

(('Warehouse', 'Region'), tuple)

In [283]:
############################
# do it with our example 
############################
vv = ['Worker', 'Client']
list(itertools.permutations(vv, 2))
len(vv)

2

In [303]:
count = 0 
perm_list = []
perms = len(vv)+1 

for x in range(perms):
    #print(x)
    p = list(itertools.permutations(vv, x))
    p_len = len(p)
    print(p_len)
    count = count +p_len 
    perm_list.append(p)
    print(perm_list)
print(count-1)

1
[[()]]
2
[[()], [('Worker',), ('Client',)]]
2
[[()], [('Worker',), ('Client',)], [('Worker', 'Client'), ('Client', 'Worker')]]
4

In [304]:
perm_list

[[()],
 [('Worker',), ('Client',)],
 [('Worker', 'Client'), ('Client', 'Worker')]]

In [305]:
perm_list[0]

[()]

In [306]:
del perm_list[0]

In [307]:
perm_list

[[('Worker',), ('Client',)], [('Worker', 'Client'), ('Client', 'Worker')]]

In [308]:
perm_list[0]

[('Worker',), ('Client',)]

In [300]:
len(perm_list[0])

2

In [320]:
#using df from above 
print(agg_var)
for r in range(len(perm_list)):
    for n in range(len(perm_list[r])):
        print(perm_list[r][n])
        g_var = list(perm_list[r][n])
        print('as list:', g_var)

{'Month': 'sum', 'Qty': 'sum', 'Amt': 'sum', 'Commission': 'sum'}
('Worker',)
as list: ['Worker']
('Client',)
as list: ['Client']
('Worker', 'Client')
as list: ['Worker', 'Client']
('Client', 'Worker')
as list: ['Client', 'Worker']

In [321]:
df.groupby(g_var).agg( agg_var ).iloc[:3]

                        Month   Qty   Amt  Commission
Client          Worker
Apex Technology Dwight     12  1700  8500      1275.0
Athleap         Jim         4   350  1750       262.5
Barbara Allen   Andy       12  1300  6500       975.0

In [323]:
#using df from above 
print(agg_var)
for r in range(len(perm_list)):
    for n in range(len(perm_list[r])):
        print(perm_list[r][n])
        g_var = list(perm_list[r][n])
        print('as list:', g_var)
        print(df.groupby(g_var).agg( agg_var ).iloc[:3])

{'Month': 'sum', 'Qty': 'sum', 'Amt': 'sum', 'Commission': 'sum'}
('Worker',)
as list: ['Worker']
        Month    Qty    Amt  Commission
Worker
Andy       42   3450  17250      2587.5
Dwight     72  15700  78500     11775.0
Jim        52  16750  83750     12562.5
('Client',)
as list: ['Client']
                 Month   Qty   Amt  Commission
Client
Apex Technology     12  1700  8500      1275.0
Athleap              4   350  1750       262.5
Barbara Allen       12  1300  6500       975.0
('Worker', 'Client')
as list: ['Worker', 'Client']
                      Month   Qty   Amt  Commission
Worker Client
Andy   Barbara Allen     12  1300  6500       975.0
       Bob Vance          8  1300  6500       975.0
       Cornell            9   100   500        75.0
('Client', 'Worker')
as list: ['Client', 'Worker']
                        Month   Qty   Amt  Commission
Client          Worker
Apex Technology Dwight     12  1700  8500      1275.0
Athleap         Jim         4   350  1750       262.5
Barbara Allen   Andy       12  1300  6500       975.0

In [325]:
 
#using df from above 
print(agg_var)
for r in range(len(perm_list)):
    for n in range(len(perm_list[r])):
#        print(perm_list[r][n])
        g_var = list(perm_list[r][n])
#        print('as list:', g_var)
        print(df.groupby(g_var).agg( agg_var ).iloc[:3])

{'Month': 'sum', 'Qty': 'sum', 'Amt': 'sum', 'Commission': 'sum'}
        Month    Qty    Amt  Commission
Worker
Andy       42   3450  17250      2587.5
Dwight     72  15700  78500     11775.0
Jim        52  16750  83750     12562.5
                 Month   Qty   Amt  Commission
Client
Apex Technology     12  1700  8500      1275.0
Athleap              4   350  1750       262.5
Barbara Allen       12  1300  6500       975.0
                      Month   Qty   Amt  Commission
Worker Client
Andy   Barbara Allen     12  1300  6500       975.0
       Bob Vance          8  1300  6500       975.0
       Cornell            9   100   500        75.0
                        Month   Qty   Amt  Commission
Client          Worker
Apex Technology Dwight     12  1700  8500      1275.0
Athleap         Jim         4   350  1750       262.5
Barbara Allen   Andy       12  1300  6500       975.0

In [326]:
perm_list

[[('Worker',), ('Client',)], [('Worker', 'Client'), ('Client', 'Worker')]]

## Make file names for each set of features

In [332]:
g_var[1]

'Worker'

In [334]:
fileperm = 'sales_'+g_var[1]+'.xlxs'
fileperm

'sales_Worker.xlxs'

In [341]:
#not quite! 
for r in range(len(perm_list)):
    for n in range(len(perm_list[r])):
#        print(perm_list[r][n])
        g_var = list(perm_list[r][n])
        wb_name = g_var[r]
        print(wb_name)

Worker
Client
Client
Worker

In [368]:
perm_list[0]
for x in range(len(perm_list)):
#    print(perm_list[x])
    for y in range(len(perm_list[x])):
        print(perm_list[x][y])

('Worker',)
('Client',)
('Worker', 'Client')
('Client', 'Worker')

In [373]:
perm_list[0][1]

('Client',)

In [374]:
perm_list[0][0]

('Worker',)

In [375]:
perm_list

[[('Worker',), ('Client',)], [('Worker', 'Client'), ('Client', 'Worker')]]

In [376]:
perm_list[1][0]

('Worker', 'Client')

In [377]:
perm_list[1][1]

('Client', 'Worker')

In [380]:
 #concatenate items in list 
ct = list(perm_list[1][1]   )
ct

['Client', 'Worker']

In [382]:
"_".join(ct)

'Client_Worker'

In [387]:
perm_list[0]
for x in range(len(perm_list)):
#    print(perm_list[x])
    for y in range(len(perm_list[x])):
        ct = (list(perm_list[x][y]))
        label = "_".join(ct)
        print(label)

Worker
Client
Worker_Client
Client_Worker